{"attributes":{"color":"#5a88bc","description":"","name":"agentic search"},"coreMigrationVersion":"8.8.0","created_at":"2025-07-22T21:19:13.128Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"1382d10f-3930-4fe7-bfc0-ce97f9b5add4","managed":false,"references":[],"type":"tag","typeMigrationVersion":"8.0.0","updated_at":"2025-07-22T21:19:13.128Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzYxOCwxXQ=="}
{"attributes":{"breakdownField":"custom.event.category","columns":["custom.user.id","custom.search.interaction.type","custom.search.template_id","custom.search.query","custom.performance.elasticsearch_time_ms","custom.search.result.document_id","custom.search.session_id"],"description":"","grid":{"columns":{}},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.* \\n| WHERE custom.event.category == \\\"search\\\" or custom.event.category == \\\"user\\\" \\n| LIMIT 100\\n| SORT @timestamp DESC\"},\"index\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false},\"filter\":[]}"},"sort":[["@timestamp","desc"]],"tabs":[{"attributes":{"breakdownField":"custom.event.category","columns":["custom.user.id","custom.search.interaction.type","custom.search.template_id","custom.search.query","custom.performance.elasticsearch_time_ms","custom.search.result.document_id","custom.search.session_id"],"grid":{"columns":{}},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.* \\n| WHERE custom.event.category == \\\"search\\\" or custom.event.category == \\\"user\\\" \\n| LIMIT 100\\n| SORT @timestamp DESC\"},\"index\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false},\"filter\":[]}"},"sort":[["@timestamp","desc"]],"timeRestore":false},"id":"58413829-1778-4f87-ac34-b569bfe5beac","label":"Untitled"}],"timeRestore":false,"title":"Engagement Details - NEW"},"coreMigrationVersion":"8.8.0","created_at":"2025-08-07T17:08:28.536Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"e828496e-792d-4a72-9dbf-c3dab7b1d124","managed":false,"references":[{"id":"1382d10f-3930-4fe7-bfc0-ce97f9b5add4","name":"tag-ref-1382d10f-3930-4fe7-bfc0-ce97f9b5add4","type":"tag"}],"type":"search","typeMigrationVersion":"10.6.0","updated_at":"2025-08-07T17:29:43.984Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzgyLDFd"}
{"attributes":{"allowHidden":false,"fieldAttrs":"{}","fieldFormatMap":"{}","fields":"[]","name":"Search Logs","runtimeFieldMap":"{}","sourceFilters":"[]","timeFieldName":"@timestamp","title":"logs-agentic-search-o11y-autotune.*"},"coreMigrationVersion":"8.8.0","created_at":"2025-07-22T21:52:43.300Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"0dfc3c6b-d545-479d-a59f-a714e8c29a29","managed":false,"references":[],"type":"index-pattern","typeMigrationVersion":"8.0.0","updated_at":"2025-07-22T21:52:43.300Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzcsMV0="}
{"attributes":{"controlGroupInput":{"chainingSystem":"HIERARCHICAL","controlStyle":"oneLine","ignoreParentSettingsJSON":"{\"ignoreFilters\":false,\"ignoreQuery\":false,\"ignoreTimerange\":false,\"ignoreValidations\":false}","panelsJSON":"{\"32396e21-d75e-4428-989d-2103f04b3cf7\":{\"grow\":false,\"order\":0,\"type\":\"optionsListControl\",\"width\":\"medium\",\"explicitInput\":{\"dataViewId\":\"0dfc3c6b-d545-479d-a59f-a714e8c29a29\",\"fieldName\":\"custom.user.id\",\"exclude\":false,\"existsSelected\":false,\"selectedOptions\":[],\"searchTechnique\":\"prefix\",\"sort\":{\"by\":\"_count\",\"direction\":\"desc\"}}},\"66399115-9122-49be-b19e-a5c482566f71\":{\"grow\":false,\"order\":1,\"type\":\"optionsListControl\",\"width\":\"medium\",\"explicitInput\":{\"dataViewId\":\"0dfc3c6b-d545-479d-a59f-a714e8c29a29\",\"fieldName\":\"custom.search.template_id\",\"exclude\":false,\"existsSelected\":false,\"selectedOptions\":[],\"searchTechnique\":\"prefix\",\"sort\":{\"by\":\"_count\",\"direction\":\"desc\"}}}}","showApplySelections":false},"description":"","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"filter\":[],\"query\":{\"query\":\"\",\"language\":\"kuery\"}}"},"optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","panelsJSON":"[{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Search Template Usage\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT() BY template = custom.search.template_id\\n| SORT count DESC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b8425898-889e-4372-b7a8-f044bf27da43\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT() BY template = custom.search.template_id\\n| SORT count DESC\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"template\",\"fieldName\":\"template\",\"label\":\"template\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT() BY template = custom.search.template_id\\n| SORT count DESC\"},\"visualization\":{\"shape\":\"donut\",\"layers\":[{\"layerId\":\"b8425898-889e-4372-b7a8-f044bf27da43\",\"primaryGroups\":[\"template\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}},\"emptySizeRatio\":0.54,\"truncateLegend\":false,\"legendMaxLines\":3,\"percentDecimals\":0}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsPie\"}},\"panelIndex\":\"cb2ddde5-10cd-41cf-a404-627f98100cd2\",\"gridData\":{\"i\":\"cb2ddde5-10cd-41cf-a404-627f98100cd2\",\"y\":0,\"x\":0,\"w\":22,\"h\":10}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Top 10 Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS total_queries = COUNT() BY query = custom.search.query\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"64ae07c0-fd24-41f0-a6ff-f950b2b22fd6\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS total_queries = COUNT() BY query = custom.search.query\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"columns\":[{\"columnId\":\"total_queries\",\"fieldName\":\"total_queries\",\"label\":\"total_queries\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS total_queries = COUNT() BY query = custom.search.query\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"visualization\":{\"shape\":\"treemap\",\"layers\":[{\"layerId\":\"64ae07c0-fd24-41f0-a6ff-f950b2b22fd6\",\"primaryGroups\":[\"query\"],\"metrics\":[\"total_queries\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsPie\"}},\"panelIndex\":\"9d2e7467-2101-41ca-9bf3-98d7af3e8d72\",\"gridData\":{\"i\":\"9d2e7467-2101-41ca-9bf3-98d7af3e8d72\",\"y\":0,\"x\":22,\"w\":25,\"h\":10}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Search Activity\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| EVAL day = DATE_TRUNC(1 minute, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"80fa8895-9c21-4194-a0fe-ed3a0897bce1\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| EVAL day = DATE_TRUNC(1 minute, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"columns\":[{\"columnId\":\"query_count\",\"fieldName\":\"query_count\",\"label\":\"query_count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"day\",\"fieldName\":\"day\",\"label\":\"day_hour\",\"customLabel\":true,\"meta\":{\"type\":\"date\",\"esType\":\"date\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| EVAL day = DATE_TRUNC(1 minute, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"line\",\"layers\":[{\"layerId\":\"80fa8895-9c21-4194-a0fe-ed3a0897bce1\",\"seriesType\":\"line\",\"xAccessor\":\"day\",\"accessors\":[\"query_count\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"be4d49a1-4f22-4ef8-8837-6bb4d56e7f71\",\"gridData\":{\"i\":\"be4d49a1-4f22-4ef8-8837-6bb4d56e7f71\",\"y\":10,\"x\":0,\"w\":47,\"h\":7}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Repeated Queries - Tuning Candidates\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT(), avg_results = AVG(custom.search.results_count) \\n      BY query = custom.search.query, searchTemplate = custom.search.template_id\\n| WHERE count >= 3 AND avg_results < 3\\n| SORT count DESC\"},\"attributes\":{\"title\":\"count & avg_results of searchTemplate\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"873c9c3c-5e47-4af5-8af5-6edc2bab9340\":{\"index\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT(), avg_results = AVG(custom.search.results_count) \\n      BY query = custom.search.query, searchTemplate = custom.search.template_id\\n| WHERE count >= 3 AND avg_results < 3\\n| SORT count DESC\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"avg_results\",\"fieldName\":\"avg_results\",\"label\":\"avg_results\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"searchTemplate\",\"fieldName\":\"searchTemplate\",\"label\":\"searchTemplate\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT(), avg_results = AVG(custom.search.results_count) \\n      BY query = custom.search.query, searchTemplate = custom.search.template_id\\n| WHERE count >= 3 AND avg_results < 3\\n| SORT count DESC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"873c9c3c-5e47-4af5-8af5-6edc2bab9340\",\"seriesType\":\"bar_stacked\",\"xAccessor\":\"searchTemplate\",\"splitAccessor\":\"query\",\"accessors\":[\"count\",\"avg_results\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"3cdc39aa-39b1-4843-84d7-98754b68c348\",\"gridData\":{\"i\":\"3cdc39aa-39b1-4843-84d7-98754b68c348\",\"y\":29,\"x\":0,\"w\":47,\"h\":9}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Zero Result Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\" AND custom.search.results_count == 0\\n| STATS count = COUNT() BY query = custom.search.query\\n| SORT count DESC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"2c008148-eac2-405d-b1c0-82cacf64885b\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\" AND custom.search.results_count == 0\\n| STATS count = COUNT() BY query = custom.search.query\\n| SORT count DESC\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\" AND custom.search.results_count == 0\\n| STATS count = COUNT() BY query = custom.search.query\\n| SORT count DESC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"2c008148-eac2-405d-b1c0-82cacf64885b\",\"seriesType\":\"bar_horizontal_stacked\",\"xAccessor\":\"query\",\"accessors\":[\"count\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"e3ddac85-b941-4c32-a5f6-87e88bb8d2e9\",\"gridData\":{\"i\":\"e3ddac85-b941-4c32-a5f6-87e88bb8d2e9\",\"y\":38,\"x\":0,\"w\":47,\"h\":12}},{\"type\":\"search\",\"embeddableConfig\":{\"title\":\"Engagement Details\",\"description\":\"\",\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"columns\":[\"custom.user.id\",\"custom.search.session_id\",\"custom.search.interaction.type\",\"custom.search.template_id\",\"custom.search.query\",\"custom.performance.elasticsearch_time_ms\",\"custom.search.result.document_id\"]},\"panelIndex\":\"120b5110-9a6e-493f-9749-5d3283e3f1eb\",\"gridData\":{\"i\":\"120b5110-9a6e-493f-9749-5d3283e3f1eb\",\"y\":50,\"x\":0,\"w\":47,\"h\":16}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Average Result Count - Top Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS \\n    avg_results = AVG(custom.search.results_count), \\n    total_results = SUM(custom.search.results_count),\\n    count = COUNT()\\n  BY query = custom.search.query, \\n     searchTemplate = custom.search.template_id\\n| SORT avg_results DESC\\n| LIMIT 10\"},\"attributes\":{\"title\":\"avg_results & total_results & count of searchTemplate\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"0c584016-78a8-4d38-a955-1ae95cd1ef83\":{\"index\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS \\n    avg_results = AVG(custom.search.results_count), \\n    total_results = SUM(custom.search.results_count),\\n    count = COUNT()\\n  BY query = custom.search.query, \\n     searchTemplate = custom.search.template_id\\n| SORT avg_results DESC\\n| LIMIT 10\"},\"columns\":[{\"columnId\":\"avg_results\",\"fieldName\":\"avg_results\",\"label\":\"avg_results\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"},\"inMetricDimension\":true}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS \\n    avg_results = AVG(custom.search.results_count), \\n    total_results = SUM(custom.search.results_count),\\n    count = COUNT()\\n  BY query = custom.search.query, \\n     searchTemplate = custom.search.template_id\\n| SORT avg_results DESC\\n| LIMIT 10\"},\"visualization\":{\"layerId\":\"0c584016-78a8-4d38-a955-1ae95cd1ef83\",\"tagAccessor\":\"query\",\"valueAccessor\":\"avg_results\",\"maxFontSize\":72,\"minFontSize\":18,\"orientation\":\"single\",\"showLabel\":true,\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsTagcloud\"}},\"panelIndex\":\"7786eb62-2907-4e94-bfa0-0d82b352f32d\",\"gridData\":{\"i\":\"7786eb62-2907-4e94-bfa0-0d82b352f32d\",\"y\":17,\"x\":0,\"w\":47,\"h\":12}}]","timeRestore":false,"title":"Agentic Search Analytics","version":1},"coreMigrationVersion":"8.8.0","created_at":"2025-07-22T21:19:13.128Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"eb1f5b8c-c8cf-4b68-ad27-0032d4e0dad7","managed":false,"references":[{"id":"1382d10f-3930-4fe7-bfc0-ce97f9b5add4","name":"tag-ref-1382d10f-3930-4fe7-bfc0-ce97f9b5add4","type":"tag"},{"id":"e828496e-792d-4a72-9dbf-c3dab7b1d124","name":"120b5110-9a6e-493f-9749-5d3283e3f1eb:savedObjectRef","type":"search"},{"id":"0dfc3c6b-d545-479d-a59f-a714e8c29a29","name":"controlGroup_32396e21-d75e-4428-989d-2103f04b3cf7:optionsListDataView","type":"index-pattern"},{"id":"0dfc3c6b-d545-479d-a59f-a714e8c29a29","name":"controlGroup_66399115-9122-49be-b19e-a5c482566f71:optionsListDataView","type":"index-pattern"}],"type":"dashboard","typeMigrationVersion":"10.3.0","updated_at":"2025-08-07T17:38:28.842Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"Wzg2LDFd"}
{"excludedObjects":[],"excludedObjectsCount":0,"exportedCount":4,"missingRefCount":0,"missingReferences":[]}