{"attributes":{"color":"#5a88bc","description":"","name":"agentic search"},"coreMigrationVersion":"8.8.0","created_at":"2025-07-17T15:19:50.599Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"9560e55c-3570-4c64-951f-b5c059ced184","managed":false,"references":[],"type":"tag","typeMigrationVersion":"8.0.0","updated_at":"2025-07-17T15:19:50.599Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzI0NSwxXQ=="}
{"attributes":{"controlGroupInput":{"chainingSystem":"HIERARCHICAL","controlStyle":"oneLine","ignoreParentSettingsJSON":"{\"ignoreFilters\":false,\"ignoreQuery\":false,\"ignoreTimerange\":false,\"ignoreValidations\":false}","panelsJSON":"{}","showApplySelections":false},"description":"","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"filter\":[],\"query\":{\"query\":\"\",\"language\":\"kuery\"}}"},"optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","panelsJSON":"[{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Repeated Queries - Tuning Candidates\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS count = COUNT(), avg_results = AVG(event.total) BY query = event.params.query\\n| WHERE count >= 3 AND avg_results < 3\\n| SORT count DESC\"},\"attributes\":{\"title\":\"count & avg_results of query\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"f0994ebb-468e-4052-bfdb-6a91b6cf1862\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS count = COUNT(), avg_results = AVG(event.total) BY query = event.params.query\\n| WHERE count >= 3 AND avg_results < 3\\n| SORT count DESC\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"avg_results\",\"fieldName\":\"avg_results\",\"label\":\"avg_results\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS count = COUNT(), avg_results = AVG(event.total) BY query = event.params.query\\n| WHERE count >= 3 AND avg_results < 3\\n| SORT count DESC\"},\"visualization\":{\"shape\":\"treemap\",\"layers\":[{\"layerId\":\"f0994ebb-468e-4052-bfdb-6a91b6cf1862\",\"primaryGroups\":[\"query\",\"avg_results\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\"}]},\"adHocDataViews\":{\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\":{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-mastra.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsPie\"}},\"panelIndex\":\"3cdc39aa-39b1-4843-84d7-98754b68c348\",\"gridData\":{\"i\":\"3cdc39aa-39b1-4843-84d7-98754b68c348\",\"y\":12,\"x\":0,\"w\":48,\"h\":10}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Zero Result Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\" AND event.total == 0\\n| STATS count = COUNT() BY query = event.params.query\\n| SORT count DESC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"2c008148-eac2-405d-b1c0-82cacf64885b\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\" AND event.total == 0\\n| STATS count = COUNT() BY query = event.params.query\\n| SORT count DESC\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\" AND event.total == 0\\n| STATS count = COUNT() BY query = event.params.query\\n| SORT count DESC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"2c008148-eac2-405d-b1c0-82cacf64885b\",\"seriesType\":\"bar_horizontal_stacked\",\"xAccessor\":\"query\",\"accessors\":[\"count\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\":{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-mastra.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"e3ddac85-b941-4c32-a5f6-87e88bb8d2e9\",\"gridData\":{\"i\":\"e3ddac85-b941-4c32-a5f6-87e88bb8d2e9\",\"y\":31,\"x\":0,\"w\":48,\"h\":12}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Top 10 Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS total_queries = COUNT() BY query = event.params.query\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"64ae07c0-fd24-41f0-a6ff-f950b2b22fd6\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS total_queries = COUNT() BY query = event.params.query\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"columns\":[{\"columnId\":\"total_queries\",\"fieldName\":\"total_queries\",\"label\":\"total_queries\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS total_queries = COUNT() BY query = event.params.query\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"visualization\":{\"shape\":\"treemap\",\"layers\":[{\"layerId\":\"64ae07c0-fd24-41f0-a6ff-f950b2b22fd6\",\"primaryGroups\":[\"query\"],\"metrics\":[\"total_queries\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\":{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-mastra.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsPie\"}},\"panelIndex\":\"9d2e7467-2101-41ca-9bf3-98d7af3e8d72\",\"gridData\":{\"i\":\"9d2e7467-2101-41ca-9bf3-98d7af3e8d72\",\"y\":0,\"x\":28,\"w\":20,\"h\":12}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Search Template Usage\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS count = COUNT() BY template = event.params.searchTemplateId\\n| SORT count DESC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b8425898-889e-4372-b7a8-f044bf27da43\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS count = COUNT() BY template = event.params.searchTemplateId\\n| SORT count DESC\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"template\",\"fieldName\":\"template\",\"label\":\"template\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS count = COUNT() BY template = event.params.searchTemplateId\\n| SORT count DESC\"},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"b8425898-889e-4372-b7a8-f044bf27da43\",\"primaryGroups\":[\"template\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\":{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-mastra.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsPie\"}},\"panelIndex\":\"cb2ddde5-10cd-41cf-a404-627f98100cd2\",\"gridData\":{\"i\":\"cb2ddde5-10cd-41cf-a404-627f98100cd2\",\"y\":0,\"x\":0,\"w\":13,\"h\":12}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Search Activity\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| EVAL day = DATE_TRUNC(1 hour, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"80fa8895-9c21-4194-a0fe-ed3a0897bce1\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| EVAL day = DATE_TRUNC(1 hour, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"columns\":[{\"columnId\":\"query_count\",\"fieldName\":\"query_count\",\"label\":\"query_count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"day\",\"fieldName\":\"day\",\"label\":\"day_hour\",\"customLabel\":true,\"meta\":{\"type\":\"date\",\"esType\":\"date\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| EVAL day = DATE_TRUNC(1 hour, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"line\",\"layers\":[{\"layerId\":\"80fa8895-9c21-4194-a0fe-ed3a0897bce1\",\"seriesType\":\"line\",\"xAccessor\":\"day\",\"accessors\":[\"query_count\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\":{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-mastra.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"be4d49a1-4f22-4ef8-8837-6bb4d56e7f71\",\"gridData\":{\"i\":\"be4d49a1-4f22-4ef8-8837-6bb4d56e7f71\",\"y\":0,\"x\":13,\"w\":15,\"h\":12}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Average Result Count - Top Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS \\n    avg_results = AVG(event.total), \\n    total_results = SUM(event.total), \\n    count = COUNT()\\n  BY query = event.params.query\\n| SORT avg_results DESC\\n| LIMIT 10\"},\"attributes\":{\"title\":\"avg_results & total_results & count of query\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"363b2ffa-80a0-47ac-a37e-d0c16a42fd82\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS \\n    avg_results = AVG(event.total), \\n    total_results = SUM(event.total), \\n    count = COUNT()\\n  BY query = event.params.query\\n| SORT avg_results DESC\\n| LIMIT 10\"},\"columns\":[{\"columnId\":\"avg_results\",\"fieldName\":\"avg_results\",\"label\":\"avg_results\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-mastra.*\\n| WHERE event.type == \\\"SEARCH\\\"\\n| STATS \\n    avg_results = AVG(event.total), \\n    total_results = SUM(event.total), \\n    count = COUNT()\\n  BY query = event.params.query\\n| SORT avg_results DESC\\n| LIMIT 10\"},\"visualization\":{\"layerId\":\"363b2ffa-80a0-47ac-a37e-d0c16a42fd82\",\"layerType\":\"data\",\"metricAccessor\":\"avg_results\",\"breakdownByAccessor\":\"query\",\"valueFontMode\":\"fit\",\"valuesTextAlign\":\"right\",\"titlesTextAlign\":\"left\"},\"adHocDataViews\":{\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\":{\"id\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"title\":\"logs-mastra.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-mastra.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsMetric\"}},\"panelIndex\":\"7786eb62-2907-4e94-bfa0-0d82b352f32d\",\"gridData\":{\"i\":\"7786eb62-2907-4e94-bfa0-0d82b352f32d\",\"y\":22,\"x\":0,\"w\":48,\"h\":9}}]","timeRestore":false,"title":"Agentic Search Analytics","version":1},"coreMigrationVersion":"8.8.0","created_at":"2025-07-17T15:21:16.963Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"2714f39b-b678-4cab-8b53-e58339bd992e","managed":false,"references":[{"id":"9560e55c-3570-4c64-951f-b5c059ced184","name":"tag-ref-9560e55c-3570-4c64-951f-b5c059ced184","type":"tag"}],"type":"dashboard","typeMigrationVersion":"10.3.0","updated_at":"2025-07-17T16:48:22.624Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzUzLDFd"}
{"excludedObjects":[],"excludedObjectsCount":0,"exportedCount":2,"missingRefCount":0,"missingReferences":[]}