{"attributes":{"color":"#5a88bc","description":"","name":"agentic search"},"coreMigrationVersion":"8.8.0","created_at":"2025-07-22T21:19:13.128Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"1382d10f-3930-4fe7-bfc0-ce97f9b5add4","managed":false,"references":[],"type":"tag","typeMigrationVersion":"8.0.0","updated_at":"2025-07-22T21:19:13.128Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzYxOCwxXQ=="}
{"attributes":{"breakdownField":"custom.event.action","columns":["custom.user.id","custom.session.id","custom.event.type","custom.query.template_id","custom.query.text","custom.query.filters.features","custom.query.result_count","custom.performance.elasticsearch_time_ms","custom.performance.search_time_ms","custom.query.filters.bathrooms","custom.query.filters.bedrooms","custom.query.filters.geo.distance","custom.query.filters.geo.latitude","custom.query.filters.geo.longitude","custom.query.filters.home_price","custom.query.filters.maintenance","custom.query.filters.square_footage"],"description":"","grid":{"columns":{}},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.* \\n| WHERE custom.event.type == \\\"search\\\" \\n| LIMIT 10000\\n| SORT @timestamp DESC\"},\"index\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false},\"filter\":[]}"},"sort":[["@timestamp","desc"]],"tabs":[{"attributes":{"breakdownField":"custom.event.action","columns":["custom.user.id","custom.session.id","custom.event.type","custom.query.template_id","custom.query.text","custom.query.filters.features","custom.query.result_count","custom.performance.elasticsearch_time_ms","custom.performance.search_time_ms","custom.query.filters.bathrooms","custom.query.filters.bedrooms","custom.query.filters.geo.distance","custom.query.filters.geo.latitude","custom.query.filters.geo.longitude","custom.query.filters.home_price","custom.query.filters.maintenance","custom.query.filters.square_footage"],"grid":{"columns":{}},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.* \\n| WHERE custom.event.type == \\\"search\\\" \\n| LIMIT 10000\\n| SORT @timestamp DESC\"},\"index\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false},\"filter\":[]}"},"sort":[["@timestamp","desc"]],"timeRestore":false},"id":"85a44823-f150-4998-8a5c-4960d46214b8","label":"Untitled"}],"timeRestore":false,"title":"Search Details"},"coreMigrationVersion":"8.8.0","created_at":"2025-07-24T17:51:47.539Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"1b1beade-0789-4e0d-b62d-92726c20568e","managed":false,"references":[{"id":"1382d10f-3930-4fe7-bfc0-ce97f9b5add4","name":"tag-ref-1382d10f-3930-4fe7-bfc0-ce97f9b5add4","type":"tag"}],"type":"search","typeMigrationVersion":"10.6.0","updated_at":"2025-08-12T11:24:47.316Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzEyMSwxXQ=="}
{"attributes":{"breakdownField":"custom.event.action","columns":["custom.user.id","custom.session.id","custom.query.result_count","custom.result.position","custom.interaction.original_message","custom.interaction.type","custom.result.document_id"],"description":"","grid":{"columns":{}},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.* \\n| WHERE custom.event.type == \\\"engagement\\\" \\n| LIMIT 10000\\n| SORT @timestamp DESC\"},\"index\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false},\"filter\":[]}"},"sort":[["@timestamp","desc"]],"tabs":[{"attributes":{"breakdownField":"custom.event.action","columns":["custom.user.id","custom.session.id","custom.query.result_count","custom.result.position","custom.interaction.original_message","custom.interaction.type","custom.result.document_id"],"grid":{"columns":{}},"hideChart":false,"isTextBasedQuery":true,"kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.* \\n| WHERE custom.event.type == \\\"engagement\\\" \\n| LIMIT 10000\\n| SORT @timestamp DESC\"},\"index\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false},\"filter\":[]}"},"sort":[["@timestamp","desc"]],"timeRestore":false},"id":"d90d14a6-ca2e-4bc9-a60a-733990036eec","label":"Untitled"}],"timeRestore":false,"title":"Engagement Details"},"coreMigrationVersion":"8.8.0","created_at":"2025-08-12T11:32:11.280Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"18882b19-67f6-4711-83c7-599aaae67e59","managed":false,"references":[{"id":"1382d10f-3930-4fe7-bfc0-ce97f9b5add4","name":"tag-ref-1382d10f-3930-4fe7-bfc0-ce97f9b5add4","type":"tag"}],"type":"search","typeMigrationVersion":"10.6.0","updated_at":"2025-08-12T11:35:37.175Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzEyNSwxXQ=="}
{"attributes":{"allowHidden":false,"fieldAttrs":"{\"@timestamp\":{\"count\":3},\"custom.@timestamp\":{\"count\":1},\"custom.event.type\":{\"count\":8},\"event.type\":{\"count\":1},\"custom.event.action\":{\"count\":3},\"custom.query.filters.home_price\":{\"count\":2},\"custom.query.text\":{\"count\":3},\"custom.result.position\":{\"count\":2}}","fieldFormatMap":"{}","fields":"[]","name":"search-logs","runtimeFieldMap":"{}","sourceFilters":"[]","timeFieldName":"@timestamp","title":"logs-agentic-search-o11y-autotune.events"},"coreMigrationVersion":"8.8.0","created_at":"2025-07-22T21:17:10.123Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"83c04cf1-cc52-4242-b91f-a81c7b8ca84b","managed":false,"references":[],"type":"index-pattern","typeMigrationVersion":"8.0.0","updated_at":"2025-08-25T22:42:47.942Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzI0MSwxXQ=="}
{"attributes":{"controlGroupInput":{"chainingSystem":"HIERARCHICAL","controlStyle":"oneLine","ignoreParentSettingsJSON":"{\"ignoreFilters\":false,\"ignoreQuery\":false,\"ignoreTimerange\":false,\"ignoreValidations\":false}","panelsJSON":"{\"d6c4790d-4a8e-4928-a493-c2a847201bef\":{\"grow\":false,\"order\":0,\"type\":\"optionsListControl\",\"width\":\"medium\",\"explicitInput\":{\"dataViewId\":\"83c04cf1-cc52-4242-b91f-a81c7b8ca84b\",\"fieldName\":\"custom.query.template_id\",\"exclude\":false,\"existsSelected\":false,\"selectedOptions\":[],\"searchTechnique\":\"prefix\",\"sort\":{\"by\":\"_count\",\"direction\":\"desc\"}}},\"312539a2-b9cc-40e2-b24f-406eb4ca4676\":{\"grow\":false,\"order\":1,\"type\":\"optionsListControl\",\"width\":\"medium\",\"explicitInput\":{\"dataViewId\":\"83c04cf1-cc52-4242-b91f-a81c7b8ca84b\",\"fieldName\":\"custom.user.id\",\"exclude\":false,\"existsSelected\":false,\"selectedOptions\":[],\"searchTechnique\":\"prefix\",\"sort\":{\"by\":\"_count\",\"direction\":\"desc\"}}}}","showApplySelections":false},"description":"","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"filter\":[],\"query\":{\"query\":\"\",\"language\":\"kuery\"}}"},"optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","panelsJSON":"[{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Click Thru Rate \",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.result.document_id IS NOT NULL\\n  AND custom.event.action IN (\\\"search_result_logged\\\",\\\"property_engagement\\\")\\n| STATS\\n    impressions = SUM((custom.event.action == \\\"search_result_logged\\\")::integer),\\n    clicks      = SUM((custom.event.action == \\\"property_engagement\\\")::integer),\\n    template_id = MAX(custom.query.template_id)\\n  BY doc_id = custom.result.document_id,\\n     session = custom.session.id,\\n     user    = custom.user.id\\n| STATS\\n    impressions = SUM(impressions),\\n    clicks      = SUM(clicks)\\n  BY template_id\\n| WHERE template_id IS NOT NULL  \\n| EVAL ctr = COALESCE(clicks * 1.0 / impressions, 0)\\n| SORT ctr DESC\\n| KEEP template_id, ctr\\n| LIMIT 1000\"},\"attributes\":{\"title\":\"ctr\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b826f4aa-2b26-43de-967b-a7e0f7e294a1\":{\"index\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.result.document_id IS NOT NULL\\n  AND custom.event.action IN (\\\"search_result_logged\\\",\\\"property_engagement\\\")\\n| STATS\\n    impressions = SUM((custom.event.action == \\\"search_result_logged\\\")::integer),\\n    clicks      = SUM((custom.event.action == \\\"property_engagement\\\")::integer),\\n    template_id = MAX(custom.query.template_id)\\n  BY doc_id = custom.result.document_id,\\n     session = custom.session.id,\\n     user    = custom.user.id\\n| STATS\\n    impressions = SUM(impressions),\\n    clicks      = SUM(clicks)\\n  BY template_id\\n| WHERE template_id IS NOT NULL  \\n| EVAL ctr = COALESCE(clicks * 1.0 / impressions, 0)\\n| SORT ctr DESC\\n| KEEP template_id, ctr\\n| LIMIT 1000\"},\"columns\":[{\"columnId\":\"ctr\",\"fieldName\":\"ctr\",\"label\":\"ctr\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true,\"params\":{\"format\":{\"id\":\"percent\",\"params\":{\"decimals\":2}}}},{\"columnId\":\"10c263bd-a83d-4214-a7eb-575a2af16316\",\"fieldName\":\"template_id\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\",\"sourceParams\":{\"indexPattern\":\"logs-agentic-search-o11y-autotune.*\",\"sourceField\":\"template_id\"}},\"label\":\"template_id\"}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.result.document_id IS NOT NULL\\n  AND custom.event.action IN (\\\"search_result_logged\\\",\\\"property_engagement\\\")\\n| STATS\\n    impressions = SUM((custom.event.action == \\\"search_result_logged\\\")::integer),\\n    clicks      = SUM((custom.event.action == \\\"property_engagement\\\")::integer),\\n    template_id = MAX(custom.query.template_id)\\n  BY doc_id = custom.result.document_id,\\n     session = custom.session.id,\\n     user    = custom.user.id\\n| STATS\\n    impressions = SUM(impressions),\\n    clicks      = SUM(clicks)\\n  BY template_id\\n| WHERE template_id IS NOT NULL  \\n| EVAL ctr = COALESCE(clicks * 1.0 / impressions, 0)\\n| SORT ctr DESC\\n| KEEP template_id, ctr\\n| LIMIT 1000\"},\"visualization\":{\"layerId\":\"b826f4aa-2b26-43de-967b-a7e0f7e294a1\",\"layerType\":\"data\",\"metricAccessor\":\"ctr\",\"breakdownByAccessor\":\"10c263bd-a83d-4214-a7eb-575a2af16316\",\"palette\":{\"name\":\"custom\",\"type\":\"palette\",\"params\":{\"steps\":3,\"name\":\"custom\",\"reverse\":false,\"rangeType\":\"percent\",\"rangeMin\":null,\"rangeMax\":null,\"progression\":\"fixed\",\"stops\":[{\"color\":\"#F6726A\",\"stop\":33.33},{\"color\":\"#fcd883\",\"stop\":66.66},{\"color\":\"#16c559\",\"stop\":100}],\"colorStops\":[{\"color\":\"#F6726A\",\"stop\":null},{\"color\":\"#fcd883\",\"stop\":33.33},{\"color\":\"#16c559\",\"stop\":66.66}],\"continuity\":\"all\",\"maxSteps\":5}}},\"adHocDataViews\":{\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsMetric\"}},\"panelIndex\":\"70ea672d-943b-44b9-b6f0-178acc2a8f84\",\"gridData\":{\"i\":\"70ea672d-943b-44b9-b6f0-178acc2a8f84\",\"y\":0,\"x\":0,\"w\":40,\"h\":4}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Impressions & Clicks\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.result.document_id IS NOT NULL\\n  AND custom.event.action IN (\\\"search_result_logged\\\",\\\"property_engagement\\\")\\n| STATS\\n    impressions = SUM((custom.event.action == \\\"search_result_logged\\\")::integer),\\n    clicks      = SUM((custom.event.action == \\\"property_engagement\\\")::integer),\\n    template_id = MAX(custom.query.template_id)\\n  BY doc_id = custom.result.document_id,\\n     session = custom.session.id,\\n     user    = custom.user.id\\n| STATS\\n    impressions = SUM(impressions),\\n    clicks      = SUM(clicks)\\n  BY template_id\\n| EVAL ctr = COALESCE(clicks * 1.0 / impressions, 0)\\n| SORT ctr DESC\\n| LIMIT 1000\"},\"attributes\":{\"title\":\"impressions & clicks & ctr of template_id\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"408b2fd0-861f-463d-b7f3-e1468f04ca73\":{\"index\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.result.document_id IS NOT NULL\\n  AND custom.event.action IN (\\\"search_result_logged\\\",\\\"property_engagement\\\")\\n| STATS\\n    impressions = SUM((custom.event.action == \\\"search_result_logged\\\")::integer),\\n    clicks      = SUM((custom.event.action == \\\"property_engagement\\\")::integer),\\n    template_id = MAX(custom.query.template_id)\\n  BY doc_id = custom.result.document_id,\\n     session = custom.session.id,\\n     user    = custom.user.id\\n| STATS\\n    impressions = SUM(impressions),\\n    clicks      = SUM(clicks)\\n  BY template_id\\n| EVAL ctr = COALESCE(clicks * 1.0 / impressions, 0)\\n| SORT ctr DESC\\n| LIMIT 1000\"},\"columns\":[{\"columnId\":\"impressions\",\"fieldName\":\"impressions\",\"label\":\"impressions\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"clicks\",\"fieldName\":\"clicks\",\"label\":\"clicks\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"template_id\",\"fieldName\":\"template_id\",\"label\":\"template_id\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.result.document_id IS NOT NULL\\n  AND custom.event.action IN (\\\"search_result_logged\\\",\\\"property_engagement\\\")\\n| STATS\\n    impressions = SUM((custom.event.action == \\\"search_result_logged\\\")::integer),\\n    clicks      = SUM((custom.event.action == \\\"property_engagement\\\")::integer),\\n    template_id = MAX(custom.query.template_id)\\n  BY doc_id = custom.result.document_id,\\n     session = custom.session.id,\\n     user    = custom.user.id\\n| STATS\\n    impressions = SUM(impressions),\\n    clicks      = SUM(clicks)\\n  BY template_id\\n| EVAL ctr = COALESCE(clicks * 1.0 / impressions, 0)\\n| SORT ctr DESC\\n| LIMIT 1000\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"bottom\",\"showSingleSeries\":true,\"isInside\":false,\"verticalAlignment\":\"bottom\",\"horizontalAlignment\":\"left\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"408b2fd0-861f-463d-b7f3-e1468f04ca73\",\"seriesType\":\"bar_stacked\",\"xAccessor\":\"template_id\",\"accessors\":[\"impressions\",\"clicks\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"d095d3fe-68df-466a-84c0-24491f189916\",\"gridData\":{\"i\":\"d095d3fe-68df-466a-84c0-24491f189916\",\"y\":14,\"x\":0,\"w\":22,\"h\":12}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Search Template Usage\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT() BY template = custom.query.template_id\\n| SORT count DESC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b8425898-889e-4372-b7a8-f044bf27da43\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT() BY template = custom.query.template_id\\n| SORT count DESC\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"template\",\"fieldName\":\"template\",\"label\":\"template\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS count = COUNT() BY template = custom.query.template_id\\n| SORT count DESC\"},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"b8425898-889e-4372-b7a8-f044bf27da43\",\"primaryGroups\":[\"template\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsPie\"}},\"panelIndex\":\"cb2ddde5-10cd-41cf-a404-627f98100cd2\",\"gridData\":{\"i\":\"cb2ddde5-10cd-41cf-a404-627f98100cd2\",\"y\":14,\"x\":22,\"w\":18,\"h\":12}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Average Click Position\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.action IN (\\\"property_engagement\\\",\\\"search_result_logged\\\")\\n| EVAL\\n    is_click = custom.event.action == \\\"property_engagement\\\",\\n    pos      = CASE(is_click, custom.result.position, null),\\n    tmpl     = CASE(custom.event.action == \\\"search_result_logged\\\", custom.query.template_id, null)\\n| STATS\\n    session_clicks  = COUNT(pos),\\n    session_pos_sum = SUM(pos),\\n    template_id     = MAX(tmpl)              // lexical pick; use only if one template per session\\n  BY custom.session.id\\n| WHERE template_id IS NOT NULL\\n| STATS\\n    clicks  = SUM(session_clicks),\\n    pos_sum = SUM(session_pos_sum)\\n  BY template_id\\n| EVAL avg_click_position = CASE(clicks > 0, pos_sum * 1.0 / clicks, 0)\\n| SORT avg_click_position ASC\"},\"attributes\":{\"title\":\"clicks & pos_sum & avg_click_position of template_id\",\"references\":[],\"state\":{\"visualization\":{\"layerId\":\"64c0c061-d5d4-4ceb-a96e-67a96dc71e89\",\"layerType\":\"data\",\"metricAccessor\":\"clicks\",\"breakdownByAccessor\":\"template_id\",\"valuesTextAlign\":\"left\",\"palette\":{\"type\":\"palette\",\"name\":\"status\",\"params\":{\"name\":\"status\",\"reverse\":false,\"rangeType\":\"number\",\"rangeMin\":null,\"rangeMax\":null,\"progression\":\"fixed\",\"stops\":[{\"color\":\"#24c292\",\"stop\":0.5},{\"color\":\"#fcd883\",\"stop\":1.01},{\"color\":\"#f6726a\",\"stop\":1.52}],\"steps\":3,\"colorStops\":[],\"continuity\":\"all\",\"maxSteps\":5}}},\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.action IN (\\\"property_engagement\\\",\\\"search_result_logged\\\")\\n| EVAL\\n    is_click = custom.event.action == \\\"property_engagement\\\",\\n    pos      = CASE(is_click, custom.result.position, null),\\n    tmpl     = CASE(custom.event.action == \\\"search_result_logged\\\", custom.query.template_id, null)\\n| STATS\\n    session_clicks  = COUNT(pos),\\n    session_pos_sum = SUM(pos),\\n    template_id     = MAX(tmpl)              // lexical pick; use only if one template per session\\n  BY custom.session.id\\n| WHERE template_id IS NOT NULL\\n| STATS\\n    clicks  = SUM(session_clicks),\\n    pos_sum = SUM(session_pos_sum)\\n  BY template_id\\n| EVAL avg_click_position = CASE(clicks > 0, pos_sum * 1.0 / clicks, 0)\\n| SORT avg_click_position ASC\"},\"filters\":[],\"datasourceStates\":{\"textBased\":{\"layers\":{\"64c0c061-d5d4-4ceb-a96e-67a96dc71e89\":{\"index\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.action IN (\\\"property_engagement\\\",\\\"search_result_logged\\\")\\n| EVAL\\n    is_click = custom.event.action == \\\"property_engagement\\\",\\n    pos      = CASE(is_click, custom.result.position, null),\\n    tmpl     = CASE(custom.event.action == \\\"search_result_logged\\\", custom.query.template_id, null)\\n| STATS\\n    session_clicks  = COUNT(pos),\\n    session_pos_sum = SUM(pos),\\n    template_id     = MAX(tmpl)              // lexical pick; use only if one template per session\\n  BY custom.session.id\\n| WHERE template_id IS NOT NULL\\n| STATS\\n    clicks  = SUM(session_clicks),\\n    pos_sum = SUM(session_pos_sum)\\n  BY template_id\\n| EVAL avg_click_position = CASE(clicks > 0, pos_sum * 1.0 / clicks, 0)\\n| SORT avg_click_position ASC\"},\"columns\":[{\"columnId\":\"clicks\",\"fieldName\":\"avg_click_position\",\"label\":\"clicks\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\",\"sourceParams\":{\"indexPattern\":\"logs-agentic-search-o11y-autotune.events\",\"sourceField\":\"avg_click_position\"}},\"inMetricDimension\":true,\"params\":{\"format\":{\"id\":\"number\",\"params\":{\"decimals\":0}}}},{\"columnId\":\"template_id\",\"fieldName\":\"template_id\",\"label\":\"template_id\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"internalReferences\":[{\"type\":\"index-pattern\",\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"name\":\"textBasedLanguages-datasource-layer-64c0c061-d5d4-4ceb-a96e-67a96dc71e89\"}],\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}}},\"visualizationType\":\"lnsMetric\",\"type\":\"lens\"}},\"panelIndex\":\"3a1d5ccf-5f36-4e2d-a578-0e6de42c689f\",\"gridData\":{\"i\":\"3a1d5ccf-5f36-4e2d-a578-0e6de42c689f\",\"y\":26,\"x\":0,\"w\":40,\"h\":4}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Top Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS total_queries = COUNT() BY query = custom.query.text\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"64ae07c0-fd24-41f0-a6ff-f950b2b22fd6\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS total_queries = COUNT() BY query = custom.query.text\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"columns\":[{\"columnId\":\"total_queries\",\"fieldName\":\"total_queries\",\"label\":\"total_queries\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS total_queries = COUNT() BY query = custom.query.text\\n| SORT total_queries DESC\\n| LIMIT 10\"},\"visualization\":{\"shape\":\"treemap\",\"layers\":[{\"layerId\":\"64ae07c0-fd24-41f0-a6ff-f950b2b22fd6\",\"primaryGroups\":[\"query\"],\"metrics\":[\"total_queries\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsPie\"}},\"panelIndex\":\"9d2e7467-2101-41ca-9bf3-98d7af3e8d72\",\"gridData\":{\"i\":\"9d2e7467-2101-41ca-9bf3-98d7af3e8d72\",\"y\":30,\"x\":0,\"w\":40,\"h\":10}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Search Activity\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| EVAL day = DATE_TRUNC(1 minute, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"attributes\":{\"title\":\"Bar vertical stacked\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"80fa8895-9c21-4194-a0fe-ed3a0897bce1\":{\"index\":\"f0aa2bb0a384b44b27f0362823c89431a1ed4c4dd8eb4ba99433197b216572be\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| EVAL day = DATE_TRUNC(1 minute, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"columns\":[{\"columnId\":\"query_count\",\"fieldName\":\"query_count\",\"label\":\"query_count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"day\",\"fieldName\":\"day\",\"label\":\"day_hour\",\"customLabel\":true,\"meta\":{\"type\":\"date\",\"esType\":\"date\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| EVAL day = DATE_TRUNC(1 minute, @timestamp)\\n| STATS query_count = COUNT() BY day\\n| SORT day ASC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"line\",\"layers\":[{\"layerId\":\"80fa8895-9c21-4194-a0fe-ed3a0897bce1\",\"seriesType\":\"line\",\"xAccessor\":\"day\",\"accessors\":[\"query_count\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"be4d49a1-4f22-4ef8-8837-6bb4d56e7f71\",\"gridData\":{\"i\":\"be4d49a1-4f22-4ef8-8837-6bb4d56e7f71\",\"y\":40,\"x\":0,\"w\":40,\"h\":6}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Average Result Count \",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS \\n    avg_results = AVG(custom.query.result_count), \\n    search_count = COUNT()\\n  BY query = custom.query.template_id \\n| SORT avg_results DESC\\n| LIMIT 10\"},\"attributes\":{\"title\":\"avg_results & search_count of query\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"28d70ed8-c253-4473-8a65-aea3e6976ee9\":{\"index\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS \\n    avg_results = AVG(custom.query.result_count), \\n    search_count = COUNT()\\n  BY query = custom.query.template_id \\n| SORT avg_results DESC\\n| LIMIT 10\"},\"columns\":[{\"columnId\":\"avg_results\",\"fieldName\":\"avg_results\",\"label\":\"avg_results\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"search_count\",\"fieldName\":\"search_count\",\"label\":\"search_count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS \\n    avg_results = AVG(custom.query.result_count), \\n    search_count = COUNT()\\n  BY query = custom.query.template_id \\n| SORT avg_results DESC\\n| LIMIT 10\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"28d70ed8-c253-4473-8a65-aea3e6976ee9\",\"seriesType\":\"bar_stacked\",\"xAccessor\":\"query\",\"accessors\":[\"avg_results\",\"search_count\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"7786eb62-2907-4e94-bfa0-0d82b352f32d\",\"gridData\":{\"i\":\"7786eb62-2907-4e94-bfa0-0d82b352f32d\",\"y\":46,\"x\":0,\"w\":40,\"h\":12}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Repeated Queries - Tuning Candidates\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS search_count = COUNT(), avg_results = AVG(custom.query.result_count) \\n      BY query = custom.query.text\\n| WHERE avg_results < 50\\n| SORT search_count DESC\"},\"attributes\":{\"title\":\"search_count & avg_results of query\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"4889944b-21de-4ad9-b1c7-d195b1eb8c56\":{\"index\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS search_count = COUNT(), avg_results = AVG(custom.query.result_count) \\n      BY query = custom.query.text\\n| WHERE avg_results < 50\\n| SORT search_count DESC\"},\"columns\":[{\"columnId\":\"search_count\",\"fieldName\":\"search_count\",\"label\":\"search_count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"avg_results\",\"fieldName\":\"avg_results\",\"label\":\"avg_results\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS search_count = COUNT(), avg_results = AVG(custom.query.result_count) \\n      BY query = custom.query.text\\n| WHERE avg_results < 50\\n| SORT search_count DESC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"4889944b-21de-4ad9-b1c7-d195b1eb8c56\",\"seriesType\":\"bar_horizontal_stacked\",\"xAccessor\":\"query\",\"accessors\":[\"search_count\",\"avg_results\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"3cdc39aa-39b1-4843-84d7-98754b68c348\",\"gridData\":{\"i\":\"3cdc39aa-39b1-4843-84d7-98754b68c348\",\"y\":58,\"x\":0,\"w\":40,\"h\":8}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Low Result Queries\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS search_count = COUNT(), avg_results = AVG(custom.query.result_count) \\n      BY query = custom.query.text\\n| SORT avg_results, search_count ASC\"},\"attributes\":{\"title\":\"search_count & avg_results of query\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"bb63b71a-308b-4ae9-8dc0-4cc868001047\":{\"index\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS search_count = COUNT(), avg_results = AVG(custom.query.result_count) \\n      BY query = custom.query.text\\n| SORT avg_results, search_count ASC\"},\"columns\":[{\"columnId\":\"search_count\",\"fieldName\":\"search_count\",\"label\":\"search_count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\"},\"inMetricDimension\":true},{\"columnId\":\"avg_results\",\"fieldName\":\"avg_results\",\"label\":\"avg_results\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"query\",\"fieldName\":\"query\",\"label\":\"query\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.events\\n| WHERE custom.event.category == \\\"search\\\"\\n| STATS search_count = COUNT(), avg_results = AVG(custom.query.result_count) \\n      BY query = custom.query.text\\n| SORT avg_results, search_count ASC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"bb63b71a-308b-4ae9-8dc0-4cc868001047\",\"seriesType\":\"bar_horizontal_stacked\",\"xAccessor\":\"query\",\"accessors\":[\"search_count\",\"avg_results\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\":{\"id\":\"2b30bb6f2a9b18332f212e8725b6eff27a9c601190a1475f2bb1e7d95cf33bca\",\"title\":\"logs-agentic-search-o11y-autotune.events\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.events\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"e3ddac85-b941-4c32-a5f6-87e88bb8d2e9\",\"gridData\":{\"i\":\"e3ddac85-b941-4c32-a5f6-87e88bb8d2e9\",\"y\":66,\"x\":0,\"w\":40,\"h\":12}},{\"type\":\"search\",\"embeddableConfig\":{},\"panelIndex\":\"5e95011c-4c5d-4e5d-a66f-c6edab1f4f83\",\"gridData\":{\"i\":\"5e95011c-4c5d-4e5d-a66f-c6edab1f4f83\",\"y\":78,\"x\":0,\"w\":40,\"h\":12}},{\"type\":\"search\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"grid\":{\"columns\":{\"custom.query.result_count\":{\"width\":190},\"custom.user.id\":{\"width\":157}}}},\"panelIndex\":\"3c52696e-6417-4f2e-8d7c-d15464d84f9d\",\"gridData\":{\"i\":\"3c52696e-6417-4f2e-8d7c-d15464d84f9d\",\"y\":90,\"x\":0,\"w\":40,\"h\":15}},{\"type\":\"lens\",\"embeddableConfig\":{\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"title\":\"Search Response Time\",\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.performance.elasticsearch_time_ms IS NOT NULL\\n| STATS\\n    P50 = PERCENTILE(custom.performance.elasticsearch_time_ms, 50),\\n    P95 = PERCENTILE(custom.performance.elasticsearch_time_ms, 95),\\n    P99 = PERCENTILE(custom.performance.elasticsearch_time_ms, 99)\\n  BY custom.query.template_id\\n| SORT custom.query.template_id ASC\"},\"attributes\":{\"title\":\"P50 & P95 & P99 of custom.query.template_id\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"f77d1784-43e4-4b38-85ae-df7f771d8f13\":{\"index\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.performance.elasticsearch_time_ms IS NOT NULL\\n| STATS\\n    P50 = PERCENTILE(custom.performance.elasticsearch_time_ms, 50),\\n    P95 = PERCENTILE(custom.performance.elasticsearch_time_ms, 95),\\n    P99 = PERCENTILE(custom.performance.elasticsearch_time_ms, 99)\\n  BY custom.query.template_id\\n| SORT custom.query.template_id ASC\"},\"columns\":[{\"columnId\":\"P50\",\"fieldName\":\"P50\",\"label\":\"Search Time (ms)\",\"customLabel\":true,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"P95\",\"fieldName\":\"P95\",\"label\":\"P95\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"P99\",\"fieldName\":\"P99\",\"label\":\"P99\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"double\"},\"inMetricDimension\":true},{\"columnId\":\"custom.query.template_id\",\"fieldName\":\"custom.query.template_id\",\"label\":\"Template \",\"customLabel\":true,\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\"}},\"indexPatternRefs\":[{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-agentic-search-o11y-autotune.*\\n| WHERE custom.performance.elasticsearch_time_ms IS NOT NULL\\n| STATS\\n    P50 = PERCENTILE(custom.performance.elasticsearch_time_ms, 50),\\n    P95 = PERCENTILE(custom.performance.elasticsearch_time_ms, 95),\\n    P99 = PERCENTILE(custom.performance.elasticsearch_time_ms, 99)\\n  BY custom.query.template_id\\n| SORT custom.query.template_id ASC\"},\"visualization\":{\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"fittingFunction\":\"Linear\",\"axisTitlesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"tickLabelsVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"labelsOrientation\":{\"x\":0,\"yLeft\":0,\"yRight\":0},\"gridlinesVisibilitySettings\":{\"x\":true,\"yLeft\":true,\"yRight\":true},\"preferredSeriesType\":\"bar_stacked\",\"layers\":[{\"layerId\":\"f77d1784-43e4-4b38-85ae-df7f771d8f13\",\"seriesType\":\"bar\",\"xAccessor\":\"custom.query.template_id\",\"accessors\":[\"P50\",\"P95\",\"P99\"],\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"adHocDataViews\":{\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\":{\"id\":\"f5291e0fbceff0ff78f7f21d07481988f0078d017819fecda7cc67fa23db7e04\",\"title\":\"logs-agentic-search-o11y-autotune.*\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-agentic-search-o11y-autotune.*\",\"allowHidden\":false}},\"needsRefresh\":false},\"visualizationType\":\"lnsXY\"}},\"panelIndex\":\"dbe3f149-9c0e-427a-acba-adc71f114f43\",\"gridData\":{\"i\":\"dbe3f149-9c0e-427a-acba-adc71f114f43\",\"y\":4,\"x\":0,\"w\":40,\"h\":10}}]","timeRestore":false,"title":"Agentic Search Analytics","version":1},"coreMigrationVersion":"8.8.0","created_at":"2025-07-22T21:19:13.128Z","created_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","id":"eb1f5b8c-c8cf-4b68-ad27-0032d4e0dad7","managed":false,"references":[{"id":"1382d10f-3930-4fe7-bfc0-ce97f9b5add4","name":"tag-ref-1382d10f-3930-4fe7-bfc0-ce97f9b5add4","type":"tag"},{"id":"1b1beade-0789-4e0d-b62d-92726c20568e","name":"5e95011c-4c5d-4e5d-a66f-c6edab1f4f83:savedObjectRef","type":"search"},{"id":"18882b19-67f6-4711-83c7-599aaae67e59","name":"3c52696e-6417-4f2e-8d7c-d15464d84f9d:savedObjectRef","type":"search"},{"id":"83c04cf1-cc52-4242-b91f-a81c7b8ca84b","name":"controlGroup_d6c4790d-4a8e-4928-a493-c2a847201bef:optionsListDataView","type":"index-pattern"},{"id":"83c04cf1-cc52-4242-b91f-a81c7b8ca84b","name":"controlGroup_312539a2-b9cc-40e2-b24f-406eb4ca4676:optionsListDataView","type":"index-pattern"}],"type":"dashboard","typeMigrationVersion":"10.3.0","updated_at":"2025-08-25T22:26:55.333Z","updated_by":"u_AsPvWQu3xEa2NY8hi5qqxGsCjvfWu3hgLzqRYZdPsTo_0","version":"WzE5NiwxXQ=="}
{"excludedObjects":[],"excludedObjectsCount":0,"exportedCount":5,"missingRefCount":0,"missingReferences":[]}